Tekla Open API Reference for Tekla Structures 2025
ShapeSelectionForm Constructor (List<ShapeItem>)
 Initializes a new instance of the ShapeSelectionForm class.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ShapeSelectionForm(
	List<ShapeItem> shapes
)
Public Sub New (
	shapes As List(Of ShapeItem)
)
Parameters
shapes
Type: System.Collections.Generic.List<ShapeItem>
The Shapes to be added to the dialog.
See Also
Reference
ShapeSelectionForm Class
ShapeSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace